#4. Напишете програма, в която потребителя въвежда чяло число. От него се 
#създава списък състоящ се от числата от 1 до това число . Въз основа на този 
#списък се създава речник, в който елементите на списъка служат за ключове 
#на елементите на речника , а стойностите на тези елементи в речника са 
#елементите на списъка но в обратен ред. 
#Пример : ако сме въвели числото 4 , създава се списъка [1,2,3,4 ] и на негова 
#основа се създава речник с 4 елемента : {1:4, 2:3, 3:2, 4:1}



n=int(input())
l=[]
d={}
for i in range(1,n+1):
    l.append(i)
print(l)
for i in range(1,len(l)+1):
    d[l.pop(-1)]=i
print(d)