#S=[1,2,3,4]
#print(S[4]) #-принтиране на даден елемент от листа


#s=[1,2,3,4]
#s.append(5) # -добавя в края на листа
#s.append(1)
#print(s)

#s=list(k for k in range(1,21) if k%3==0) #-добавяне на елементи в списъка
#print (s)


#s=[1,2,3,4,5,6]  #начало : край : отстъпление
#print(s[::-1])  #връща елементите в обратен ред
#print(s[:-1])   #принтиране без последния елемент
#print(s[1:])    #без първия елемент
#print(s[0:2])   #принтират се първите 2 елемента
#print(s[-1:])   #принтира само последния елемнт



#s=[1,2,3]
#s3=[3,4,6,7]
#s1=[4,5]  #събиране на списъците
#s2=s+s1+s3
#print(s2)

#s=[[1,2,3],[6,7,8],[3,1,6]] #вложени списъци
#print([1][2]) #взимаме първия списък и неговия втори елемент

#s=[2,3,4,5,6]
#for i in s:
#    print(i,end=':')  #дава различен разделител между елементите

#s=[2,3,14,5]
#for i in range(len(s)):   #обхождане на списъка по индекси
#    print(s[i], end =',')

#s=[2,3,14,5]
#s.index(3) #дава индекса на елемента
#s.count(3) #Броя на дадения елемент в списъка
#max(s)  #Максимум 
#min(s)  #Минимум

#s=[2,3,14,5]
#s+=[1,2,3,45]  #Добавяне на стойности
#s.insert(2,32) #Добавя елемент на дадена позиция и измества другите на ляво
#s.pop(3)  #Маха дадения индекс
#s.remove(2) #Маха дадената стойност
#del s[2]  #Маха по индекс

#import random

#s=[2,1,3,5]
#random.shuffle(s)  #разбърква елементите
#print(s)
#print(random.choice(s)) #извежда рандом елемент




#from audioop import reverse


#s=[2,3,31,321,5,4]
#s.sort()   #сортира от най- малко към по- голямо

#SortKey(key=str.lower,reverse)
#print(s)