#s=set([1,2,3,4,1]) #Само уникални символи се съдържат ако се принтира
#for i in s:
#    print(i,end='')
#    print(len(s))

#from os import remove


#s=set([1,2,3])
#s1=set([2,3,4])
#s2=s|s1

#print(s2)

#s3=s-s1
#print(s3) 

#s4=s&s1
#print(s4)

#s<=s1 #Дали всички стойности се съдържат в s

#s.add(8) #На случайно място

#remove(2) #маха елемента ще гръмне

#s.discard(2) #ако няма елемента няма да гръмне 

#s.pop() #рандом елемент се премахва

#s.clear() # занулява го 

#s=""" #nanqkolko reda

#s1='Hello'
#print(s1[:])

#str #Преобразува в низ
#capitalize() #Първата буква в главна
#split(',') #Разделя на поднизове
#strip('c') #Премахва символ
#swapcase() #
#title() #Главна първа
#i.replace('a','e',15)  #15 колко символа да смени


